{
    "login": "Log in",
    "reset": "Reset password",
    "or": "or",
    "register": "Register",
    "signup": "Sign up",
    "signin": "Sign in",
    "signout": "Sign Out",
    "have": "Already have an account?",
    "reset_title": "Email",
    "placeholder": "Enter your email address",
    "sent": "An email has been sent to your email address. Please follow the instructions to reset your password.",
    "mail": "Email",
    "password": "Password",
    "welcome": "Welcome!",
    "logout": "Log out from",
    "about": "About",
    "about_para": "The application provides developers with an experience to interact with GraphQL APIs and explore their schemas. Our team of three members has created this application with a focus on usability, security, and customization.",
    "about_para1":"Once authenticated, users are redirected to the GraphiQL page, where they can write and execute GraphQL queries in a fully functional editor. The editor supports syntax highlighting, auto-completion, and error checking to enhance the development process. To further enhance the flexibility of GraphQL queries, users can utilize the variables section to define and modify query variables. The headers section allows users to add custom headers to their requests for enhanced authorization or specific API requirements.",
    "about_para2":"There is also a documentation explorer. It provides a way to navigate through the GraphQL schema, discover available queries, mutations, and types, and view detailed information about each field and argument. To ensure a smooth user experience, the application includes localization support in two languages, allowing users to switch languages seamlessly. The header of the application is sticky, providing easy access to essential navigation elements even during scrolling.",
    "about_para3": "Finally, we have deployed a demo version of the application to a hosting service (netlify), allowing users to explore and interact with the GraphiQL features. The source code is available on GitHub(link).",
    "main": "Main",
    "notfound": "Not Found",
    "welcome_text1": "This is the final task of the React 2023 Q1 course at Rolling Scopes School.",
    "welcome_text2": "We are thrilled to have you here and excited to showcase what we've accomplished throughout this course. We have chosen to work with the Star Wars API, which is an extensive and rich source of data from the beloved Star Wars universe.",
    "gotomain": "Go to Main page",
    "result": "Result",
    "request": "Request",
    "email_required": "Email is required",
    "invalid_email": "Invalid email format",
    "password_required": "Password is required",
    "password_message": "Password must be at least 8 characters long",
    "password_contain":"Password must contain at least one ABC, one 123, and one &^%$#",
    "backtopage": "Back to page"
}